# Task1

In [6]:
import pandas as pd
import numpy as np

In [36]:
authors=pd.DataFrame ({'author_id':[1, 2, 3],'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])

In [37]:
print(authors)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [38]:
book=pd.DataFrame ({'author_id':[1, 1, 1, 2, 2, 3, 3],'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# Task2

In [39]:
authors_price=pd.merge(authors,book, on='author_id',how='left')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

# Task3

In [40]:
top5=authors_price.nlargest(5,'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

# Task4

In [84]:
author_name=authors_price['author_name'].unique()
max_price=authors_price.groupby('author_name').agg({'price':'max'}).reset_index().rename(columns={'price':'max_price'})
min_price=authors_price.groupby('author_name').agg({'price':'min'}).reset_index().rename(columns={'price':'min_price'})
mean_price=authors_price.groupby('author_name').agg({'price':'mean'}).reset_index().rename(columns={'price':'mean_price'})

In [88]:
max_price

  author_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [109]:
min_price

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [103]:
authors_stat=pd.DataFrame({'author_name':max_price['author_name']}, columns=['author_name'])

In [104]:
authors_stat

  author_name
0  Островский
1    Тургенев
2       Чехов

In [105]:
authors_stat['max_price']=max_price['max_price']

In [106]:
authors_stat['min_price']=min_price['min_price']

In [107]:
authors_stat['mean_price']=mean_price['mean_price']

In [108]:
authors_stat

  author_name  max_price  min_price  mean_price
0  Островский        370        290  330.000000
1    Тургенев        450        300  366.666667
2       Чехов        500        450  475.000000

# Task5

In [110]:
authors_price['cover']=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [111]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [131]:
book_info = pd.pivot_table(authors_price, values='price', index='author_name',
...                     columns='cover', aggfunc=np.sum)

In [132]:
book_info

cover        мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [137]:
book_info=book_info.fillna(0)

In [138]:
book_info.to_pickle("book_info.pkl")

In [139]:
book_info2=pd.read_pickle("book_info.pkl")

In [140]:
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0